#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # dnsimple_record.cname_1_fastmail_domainkey will be created
  + resource "dnsimple_record" "cname_1_fastmail_domainkey" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + name      = "fm1._domainkey"
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "CNAME"
      + value     = "fm1.nathanherald.com.dkim.fmhosted.com"
    }

  # dnsimple_record.cname_2_fastmail_domainkey will be created
  + resource "dnsimple_record" "cname_2_fastmail_domainkey" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + name      = "fm2._domainkey"
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "CNAME"
      + value     = "fm2.nathanherald.com.dkim.fmhosted.com"
    }

  # dnsimple_record.cname_3_fastmail_domainkey will be created
  + resource "dnsimple_record" "cname_3_fastmail_domainkey" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + name      = "fm3._domainkey"
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "CNAME"
      + value     = "fm3.nathanherald.com.dkim.fmhosted.com"
    }

  # dnsimple_record.cname_hey_domainkey will be destroyed
  - resource "dnsimple_record" "cname_hey_domainkey" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "heymail._domainkey.nathanherald.com" -> null
      - id        = "23414610" -> null
      - name      = "heymail._domainkey" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "CNAME" -> null
      - value     = "heymail._domainkey.hey.com" -> null
    }

  # dnsimple_record.mx_1_fastmail will be created
  + resource "dnsimple_record" "mx_1_fastmail" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "10"
      + ttl       = "3600"
      + type      = "MX"
      + value     = "in1-smtp.messagingengine.com"
    }

  # dnsimple_record.mx_1_hey will be destroyed
  - resource "dnsimple_record" "mx_1_hey" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "23414648" -> null
      - priority  = "10" -> null
      - ttl       = "3600" -> null
      - type      = "MX" -> null
      - value     = "work-mx.app.hey.com" -> null
    }

  # dnsimple_record.mx_2_fastmail will be created
  + resource "dnsimple_record" "mx_2_fastmail" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = "20"
      + ttl       = "3600"
      + type      = "MX"
      + value     = "in2-smtp.messagingengine.com"
    }

  # dnsimple_record.txt_dmark will be created
  + resource "dnsimple_record" "txt_dmark" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + name      = "_dmarc"
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "TXT"
      + value     = "v=DMARC1; p=none;"
    }

  # dnsimple_record.txt_fastmail_spf will be created
  + resource "dnsimple_record" "txt_fastmail_spf" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "TXT"
      + value     = "v=spf1 include:spf.messagingengine.com ?all"
    }

  # dnsimple_record.txt_hey_dmark will be destroyed
  - resource "dnsimple_record" "txt_hey_dmark" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "_dmarc.nathanherald.com" -> null
      - id        = "23414559" -> null
      - name      = "_dmarc" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "v=DMARC1; p=none;" -> null
    }

  # dnsimple_record.txt_hey_spf will be destroyed
  - resource "dnsimple_record" "txt_hey_spf" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "23414558" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "v=spf1 +a include:_spf.hey.com ~all" -> null
    }

  # dnsimple_record.txt_hey_verification will be destroyed
  - resource "dnsimple_record" "txt_hey_verification" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "23414499" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "hey-verification:y5Vmkr1f5B7Dbs4PfKdcQX7q" -> null
    }

  # dnsimple_record.txt_nathan_test will be destroyed
  - resource "dnsimple_record" "txt_nathan_test" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "_actions.nathanherald.com" -> null
      - id        = "17314149" -> null
      - name      = "_actions" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "works" -> null
    }

  # dnsimple_record.txt_now_token will be destroyed
  - resource "dnsimple_record" "txt_now_token" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "_now.nathanherald.com" -> null
      - id        = "16697514" -> null
      - name      = "_now" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "QmTHxd3KVZWrWGg3WsrS99LkNrsTAuHuNufJfhPnrYFjEo" -> null
    }

  # dnsimple_record.txt_soverin_domainkey will be destroyed
  - resource "dnsimple_record" "txt_soverin_domainkey" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "soverin._domainkey.nathanherald.com" -> null
      - id        = "17207376" -> null
      - name      = "soverin._domainkey" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA052NncuQWFqM3Kx2IrnTpYdjbzFiffKgKz9034vD0VS5QKw2rKkW5rsGXLJQhnfWVNUAEV6IY71cfq85Y0ewXUucajIKLF6xZXaVX/yh/u/4PvbQS2QIa5jB60urfIwNiFsxHzz71aHPbtnp/n1MRqgxOYw/eEm/SwfDpi4moLd5n2k6iYBDecNhzodQVdj3X09bD/tYJHGJzI3L7xq0AeuE3buquDGypHMpu3HIvXMafpufFylhmTJwyFfPJdwq7REwlEH0/UerZdnA/kj/3u5ApAVlxmvZwhgUxYfpNRiZnAIlB4AOoJHCeA/xpupT/lImrHWJSKvetkjxm3dKZwIDAQAB" -> null
    }

  # dnsimple_record.txt_soverin_verificaton will be destroyed
  - resource "dnsimple_record" "txt_soverin_verificaton" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "5064659" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "Soverin-site-verification=G7WnxsP7RuSFmUx1" -> null
    }

Plan: 7 to add, 0 to change, 9 to destroy.
```

</details>

*Workflow: `terraform`, Action: `hashicorpterraform-github-actions2`, Working Directory: `.`, Workspace: `default`*
